---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.RightOffset
source: html/5d30cbc2-2b80-5b26-3379-00d83a582d3a.htm
---
# Autodesk.Revit.DB.CameraInfo.RightOffset Property

Distance that the target plane is offset towards the right
 where right is normal to both Up direction and View direction.
 This offset shifts both left and right planes.

## Syntax (C#)
```csharp
public double RightOffset { get; }
```